// // -------------Zad2-----------------
// Перепишите код к тернарному оператору
// let test = true;
// if (test === true) {
//     console.log(`+++`);
// } else {
//     console.log(`---`);
// }

// При программировании такие проверки требуются очень часто,
// поэтому для них существует более изящная сокращенная форма
// : вместо if (test == true) можно написать просто if (test).


let test = true;
if (test) {
    console.log(`+++`);   // выведет в консоль  +++  
} else {
    console.log(`---`);
}